Revit 2027 API
RevisionNumberingSequence.GetNumericRevisionSettings Method
 Returns a copy of the NumericRevisionSettings owned by this revision numbering sequence.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public NumericRevisionSettings GetNumericRevisionSettings()
Public Function GetNumericRevisionSettings As NumericRevisionSettings
public:
NumericRevisionSettings^ GetNumericRevisionSettings()
member GetNumericRevisionSettings : unit -> NumericRevisionSettings
Return Value
NumericRevisionSettings
 The copy of the NumericRevisionSettings owned by this revision numbering sequence.
Exceptions
Exception | Condition
InvalidOperationException |  This RevisionNumberingSequence doesn't own a valid numeric revision settings.
See Also
Reference
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace